adpyke.codesnap
dbaeumer.vscode-eslint
divyanshuagrawal.competitive-programming-helper
dustypomerleau.rust-syntax
ecmel.vscode-html-css
fill-labs.dependi
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
hollowtree.vue-snippets
jeff-hykin.better-cpp-syntax
kevinrose.vsc-python-indent
llvm-vs-code-extensions.vscode-clangd
ms-ceintl.vscode-language-pack-zh-hans
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ritwickdey.liveserver
rust-lang.rust-analyzer
shd101wyy.markdown-preview-enhanced
tauri-apps.tauri-vscode
tboox.xmake-vscode
tomoki1207.pdf
twxs.cmake
usernamehw.errorlens
vadimcn.vscode-lldb
vue.volar
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
